# NewInstanceBinding Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewInstanceBinding Method
Application Class See Also
---
Creates a new empty instance binding object.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InstanceBinding NewInstanceBinding()
```

Visual Basic
---
```text
Public Function NewInstanceBinding As InstanceBinding
```

Visual C++
---
```text
public:
InstanceBinding^ NewInstanceBinding()
```

# ### Return Value
A new instance binding object.
# Remarks
Instance binding objects are used for attaching shared parameter definitions to all instances of an element within a category. Categories can be added to the instance binding via the Categories property of the InstanceBinding object
# See Also
Application Class
NewInstanceBinding Overload
Autodesk.Revit.Creation Namespace